# -*- coding: utf-8 -*-
import re

STOP_WORDS = {'', ' ', '.', ',', ';', '!', '、', '，', '；', '。', '！', '？', '│',
              '[', ']', '（', '）', '“', '”', '《', '》', '：', '-', '·', '.', '(', ')'
                                                                               '我', '我们', '你', '你们', '他', '他们', '她',
              '她们', '它', '它们',
              '这', '那', '其', '其他', '其它',
              '的', '地', '得', '着', '了', '过', '等', '吗', '吧', '之',
              '是', '为', '有', '给', '来', '去', '到', '上', '中', '下', '前', '后',
              '也', '还', '都', '将', '要', '请', '指',
              '在', '对', '于', '让', '以', '向', '由', '被', '所', '从', '即', '可',
              '和', '与', '或', '并', '及', '就', '而', '又', '因', '但',
              '个', '人',  # '年', '月', '日', '时', '分', '秒', '最', '大', '小',
              '至今', '现在',
              }

email_compile = re.compile(r'[0-9a-zA-Z.]+@[0-9a-zA-Z.]+?com')
phone_compile = re.compile(r'^(13\d|14[5|7]|15\d|166|17[3|6|7]|18\d)\d{8}$')
url_compile = re.compile(r'http[s]?://')
allowPOS = ['n', 'v', 'j', 'x']

